## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
n = int(input("Введите целое число:"))

for i in range(1, n):
    sum_div = 0
    sum_div_2 = 0
    for div in range(1, n):
        if i > div and i % div == 0:
            sum_div += div
    for div2 in range(1, n):
        if sum_div > div2 and sum_div % div2 == 0:
            sum_div_2 += div2
    if i == sum_div_2 and sum_div != sum_div_2:
        print(sum_div, i)
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
